Revit 2024 API
BuiltInFailures.StairRampFailures.RampLandingNotCreated Property
 Beginning of run coincide with the end of previous run. Landing is not created between runs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RampLandingNotCreated { get; }
Visual Basic
Public Shared ReadOnly Property RampLandingNotCreated As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RampLandingNotCreated {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace